# Show Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePane..::..Show Method
DockablePane Class See Also
---
If the pane is not currently visible or in a tab, display the pane in the Revit user interface at its last docked location.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Show()
```

Visual Basic
---
```text
Public Sub Show
```

Visual C++
---
```text
public:
void Show()
```

# See Also
DockablePane Class
Autodesk.Revit.UI Namespace